[
    {
        "title": "Marketing Specialist (m/w/d) | B2B Content Creation",
        "location": "Berlin",
        "url": "https://www.arbeitnow.com/jobs/companies/kooku-recruiting-gmbh/marketing-specialist-b2b-content-creation-berlin-499696",
        "desc": null
    },
    {
        "title": "SAP Consultant - IS Retail Pricing (m/f/d) (relocation possible)",
        "location": "Düsseldorf",
        "url": "https://www.arbeitnow.com/jobs/companies/transparent-hiring/sap-consultant-is-retail-pricing-relocation-possible-dusseldorf-203224",
        "desc": null
    },
    {
        "title": "Head of Data (all genders)",
        "location": "Rottendorf",
        "url": "https://www.arbeitnow.com/jobs/companies/primal-state-performance-gmbh/head-of-data-all-genders-rottendorf-336780",
        "desc": null
    },
    {
        "title": "Head of Performance Marketing (all genders)",
        "location": "Rottendorf",
        "url": "https://www.arbeitnow.com/jobs/companies/primal-state-performance-gmbh/head-of-performance-marketing-all-genders-rottendorf-452177",
        "desc": null
    },
    {
        "title": "Sr. Search Engineer",
        "location": "Berlin",
        "url": "https://www.arbeitnow.com/jobs/companies/qdrant/sr-search-engineer-berlin-211588",
        "desc": null
    },
    {
        "title": "General application",
        "location": "Vogtei",
        "url": "https://www.arbeitnow.com/jobs/companies/cinemo-gmbh/general-application-vogtei-311360",
        "desc": null
    },
    {
        "title": "Software Verification Engineer (m/f/x)",
        "location": "Munich",
        "url": "https://www.arbeitnow.com/jobs/companies/k-tronik-gmbh/software-verification-engineer-munich-282138",
        "desc": null
    },
    {
        "title": "Founder's Associate - Internship",
        "location": "Berlin",
        "url": "https://www.arbeitnow.com/jobs/companies/healthcaters-ug-haftungsbeschrankt/founders-associate-internship-berlin-268602",
        "desc": null
    },
    {
        "title": "Personal Shopping and Client Relations Manager (f/m/d)",
        "location": "Munich",
        "url": "https://www.arbeitnow.com/jobs/companies/mytheresa/personal-shopping-and-client-relations-manager-munich-84532",
        "desc": null
    },
    {
        "title": "Safety Specialist",
        "location": "Berlin, Berlin, Germany",
        "url": "https://www.arbeitnow.com/jobs/companies/bolt-technology/safety-specialist-berlin-261606",
        "desc": null
    },
    {
        "title": "Head of HR Business Partners Europe (m/f/d)",
        "location": "Munich, Bavaria, Germany",
        "url": "https://www.arbeitnow.com/jobs/companies/flix/head-of-hr-business-partners-europe-munich-227011",
        "desc": null
    },
    {
        "title": "Working Student/Intern Machine Learning (m/f/d)",
        "location": "Munich",
        "url": "https://www.arbeitnow.com/jobs/companies/baind-ag/working-student-intern-machine-learning-munich-499580",
        "desc": "The building sector is responsible for 40 percent of CO2 emissions in Germany, making it the largest contributor. Moreover, we spend most of our time indoors, which gives us all the more reason to operate buildings in a way that keeps people at the center, both now and in the long term. As a young PropTech startup, we are committed to exactly this goal: to operate buildings in an automated, reliable, and sustainable manner. With our intelligent building control system, we are on the path to achieving a climate-neutral building stock by 2045.\nAs a Working Student/Intern Machine Learning (m/f/d), you will work closely with top experts in their field, gaining invaluable hands-on experience with innovative technology developed over five years of research. You'll have the opportunity to deepen your machine learning skills by contributing to cutting-edge projects in energy optimization and predictive analytics.\nAufgaben\nWhat You’ll Work On: \n\nDesign and deploy ML models for energy optimization and predictive analytics, integrating solutions that are both robust and efficient. \nDevelop, test, and implement cost-effective, real-time energy management strategies. \nOptimized Workflows with CI/CD and MLOps by streamlining data handling, feature engineering, and model management to improve efficiency. \nBuild predictive models for real-time device health monitoring, boosting uptime and reducing maintenance costs.\n\nQualifikation\nWho We’re Looking For: \n\nYou’re in your 5th semester or higher in a Bachelor’s or Master’s program in Informatics or a related field. \nProficiency in Python and ML frameworks (TensorFlow, PyTorch) is essential.\nFamiliarity with scalable architectures and DevOps tools (like Docker, Kubernetes, or Kubeflow) is a plus. \nYou’re proactive, highly organized, and driven to push boundaries to set new standards in ML.\n\nBenefits\nWhy baind AG: \n\nYour Impact: Join us in transforming the building sector, responsible for 40% of Germany’s CO₂ emissions and drive toward a climate-neutral future by 2045. \nYour Chance: Join as one of the first team members in our ML team, taking on opportunities to grow with a high-impact startup that just closed a successful seed round and is ready to take off with you. \nCompetitive Pay: Starting at 21 €/h, with the potential for a raise after six months based on performance. \nComprehensive Resources: Access our in-house compute cluster for model training and fine-tuning. \nFlexible Work Environment: Choose between macOS or Linux, work up to 50% remotely, and benefit from flexible hours. \nWork-Life Balance: Enjoy a Wellpass membership with access to over 10,000 sports and wellness facilities across Germany.\n\nApply with your resume, transcript, and a brief note on why you’re a perfect fit. Specify if you’re applying for an internship, working student role, or thesis project. We are looking forward to your application!\nFind Jobs in Germany on Arbeitnow"
    },
    {
        "title": "Senior IT recruiter (m/f/d)",
        "location": "Munich",
        "url": "https://www.arbeitnow.com/jobs/companies/transparent-hiring/senior-it-recruiter-munich-139170",
        "desc": "Are you a skilled tech recruiter with a passion for technology? Do you have a proven track record of identifying and attracting top talent? We are seeking a Senior IT recruiter (m/f/d) to join our team and help us continue to grow and thrive. This is a full-time, full-remote position.\nAbout us\nTransparent Hiring is an IT recruiting and relocation company specializing in hiring English-speaking IT talents for German companies and relocating them to Germany. We work with large established German enterprises as well as young and dynamic start-ups, hiring for a wide variety of tech roles, including web, mobile, QA, data, and many more.\nWe are located in Bavaria, Germany, but operate 100% remotely and accept candidates from anywhere, given that your working hours sufficiently overlap with ours.\nAbout the role\nIn this role, you will be responsible for identifying, attracting, and hiring top technology professionals for a variety of roles. This will involve understanding the specific staffing needs of our clients, finding qualified candidates, and supporting them along the application process.\nWe look for someone who is as passionate as us about helping people find jobs and start a new life in a new country. If you want to shape the future of the small, but growing company, proactively contribute to the way we work, and grow together – you’ve found the right place.\nTasks\n\nScreen and interview candidates to assess their skills, experience, and fit for the role\nSource candidates for positions that can’t be closed with incoming job applications alone\nProvide guidance and support to candidates throughout the hiring process\nCoordinate job offers and negotiations with candidates\nMaintain accurate records and tracking metrics to measure the effectiveness of recruiting efforts\nOptimize recruiting processes and tools to improve efficiency\nUse social networks like Linkedin or Xing to promote the company and open roles\n\nRequirements\n\nStrong communication and interpersonal skills, ability to establish trust and rapport with people\nExperience as an IT recruiter (preferably in a staffing agency)\nExperience in hiring on the global market (preferably German)\nGood understanding of the information technology industry\nSelf-organization and time management skills\nFluent English C1+\n\nBenefits\n\nInformal, friendly and collaborative atmosphere in the team\nWork from anywhere in the world\nFlexible working hours\nPerformance bonuses for successful hires\n\nWant the flexibility of working from anywhere? Want to work with people that love and enjoy what they do? Join our young international team and become part of a friendly and collaborative environment, with zero bureaucracy, and quick decision-making. You will work directly with the founding team and get an opportunity to shape the company in its early days.\nIf you are a skilled tech recruiter with a passion for technology, we want to hear from you. Apply now to join our team and help us continue to grow and thrive.\nFind Jobs in Germany on Arbeitnow"
    },
    {
        "title": "Junior Communications Manager EU Projects - Aqua Team (m/f/d)",
        "location": "Berlin",
        "url": "https://www.arbeitnow.com/jobs/companies/submariner-network-for-blue-growth-eeig/junior-communications-manager-eu-projects-aqua-team-berlin-131137",
        "desc": "sPro - sustainable-projects is a consultancy specialized in the coordination of transnational projects, mostly funded by the European Commission. Our topical focus lies in projects dealing with the sustainable use of the sea. We run the permanent secretariat of the SUBMARINER Network for Blue Growth and act as coordinators of the EU Mission Ocean in the Baltic and North Sea. SUBMARINER is the cooperation platform for actors/initiatives across the Baltic Sea Region and beyond who promote innovative and sustainable uses of marine resources.\nWe have a long-term portfolio of over 25 large-scale projects and operate with an extensive network of trusted cooperation partners from all European countries, encompassing research, industry, business development, NGOs, and the public sector. We currently have 35 employees coming from a wide range of different academic backgrounds with more than 15 different nationalities.\nThe Aquatic Value Chains team manages SUBMARINER Network and s Pro’s participation in 12 different projects and service contracts focusing on topics including algae and mussel cultivation and product development, sustainable fisheries, recirculating aquaculture systems and ocean regeneration.\nTasks\n\nPlanning and implementing communications and dissemination strategies and activities in the framework of EU-funded projects across different topics (e.g. algae and mussel cultivation and product development, sustainable fisheries, recirculating aquaculture systems and ocean regeneration).\nPlanning, organising and participating in meetings and events (in-person & online), overseeing logistics and technical support when necessary.\nConverting reports and other project content into understandable articles, abstracts, presentations, animations, etc., for our various media channels.\nContent design and optimisation of the appearance and content of our various websites (text, images, graphics, podcasts, video), social media accounts (LinkedIn, Facebook, Instagram, Twitter, YouTube, TikTok), and other communications content.\nEnsuring that project communication is coherent and feeds into the company-level communication strategy.\nAssisting in various tasks within the management of projects.\n\nRequirements\n\nRelevant university degree.\nFirst relevant work experience, ideally working in EU projects and/or relevant industry sectors.\nExcellent English with proven writing skills. Additional languages (especially advanced German) are a plus.\nProven ability in project communications, management and verbal communication.\nDigital native with good knowledge of the Microsoft Suite (Word, Excel, Powerpoint), CMS (esp. WordPress), collaboration tools (e.g., Miro, slido) and able to create attractive digital content (e.g. Canva, InDesign, Adobe Photoshop, Illustrator).\nExperience on how to use social media as a dissemination tool (e.g., LinkedIn, Twitter, YouTube, TikTok).\nUnderstanding of European political processes; esp. in the field of climate and environmental protection is a plus.\n\nBenefits\n\nA meaningful job in a very dynamically evolving environment, where you contribute to restoring our Seas and Oceans and promoting a sustainable blue economy.\nAn interesting multi-cultural, international and diverse team.\nOpportunity to travel within Europe for project meetings and events.\nIndividual career development.\nA beautiful loft office in Berlin.\nUp to three home office days per week; flexible working hours and 28 days of holiday annually.\nRegular overall team retreats to promote internal knowledge transfer, generate shared ideas and strengthen the working atmosphere.\nAnnual salary range of EUR 33.000 to 42.000 depending on experience.\n\nFind more English Speaking Jobs in Germany on Arbeitnow"
    },
    {
        "title": "Technical co-founder",
        "location": "Berlin",
        "url": "https://www.arbeitnow.com/jobs/companies/mumbi/technical-co-founder-berlin-360547",
        "desc": "Imagine empowering children and families to thrive. \nNow, imagine yourself at the heart of this transformation.\nJoin us as a technical co-founder to drive real impact! \n🌍 Our Vision & 🎯 Mission:\nMUMBI is an AI-powered app focused on enhancing the brain and mental health of children and parents. Our vision is to empower families to become smarter and more resilient through science-backed play. Our mission is to make brain-boosting, personalized play a seamless part of daily life using everyday items. With almost 90% of a child’s brain developing by age five and mental health challenges predicted to affect half the world (WHO), early intervention is essential to prevent mental health struggles and help families thrive.\nTasks\n\nCo-create the future of MUMBI and FamilyTech\nLead technical development and engineering teams\nScale the product for growth and impact\n\nRequirements\n🔍 We are looking for a visionary partner who:\n👉 Aligns with MUMBI's vision and shares passion to make it a success\n👉 Is an experienced AI/ML engineer to lead technical development\n👉 Has proven ability to scale products and lead engineering teams\n👉 Is ideally a parent and previous founder, or an entrepreneurial mind\nBenefits\n🚀 Why Join MUMBI?\n✔ Seize the Moment: Lead the booming AI x Parenting frontier.\n✔ Make an Impact: Drive resilience, mental health, and transformation in families.\n✔ Collaborate & Innovate: Bring your ideas to life with MUMBI.\n🤝 Let’s Connect:\nReady to lead, innovate, and transform families at scale? Let’s talk!\n 🔗 Connect on LinkedIn linkedin.com/in/ezgikw\nFind Jobs in Germany on Arbeitnow"
    },
    {
        "title": "Operations Manager (m/f/d)",
        "location": "Berlin",
        "url": "https://www.arbeitnow.com/jobs/companies/coretylynt/operations-manager-berlin-8553",
        "desc": "Founded in 2021, the company is a trailblazing supply chain platform that has redefined the way large construction material orders are sourced, distributed, and financed. They are on a mission to unlock the vast potential of cross-border supply for the Western Market by providing access to high-quality construction materials at a global scale through their innovative platform. Since its launch in January 2022, the company has successfully served hundreds of companies and generated exponential growth toward profitability.  \nThe company’s distinct competitive advantage lies in its ability to organize the supply chain through digital innovation. By eliminating middlemen and embracing tech-first and AI, it creates a seamless connection between suppliers and buyers. Its proprietary platform technology not only facilitates supply and demand matching but also offers a comprehensive suite of services, including cloud inventory management, fulfillment solutions, and fintech capabilities.  \nSince its inception, the company has been at the forefront of construction material management, helping companies access high-quality materials efficiently and cost-effectively. The platform provides a user-friendly experience that empowers businesses to thrive. The company counts 75+ FTEs located across Germany (Berlin HQ), China, and India. The company is on track to achieve profitability and generated triple digits million GMV.\nTasks\n\nBe the referent for all post-sales customer-related topics.\nEnsure timely and satisfactory resolution of all incoming customer inquiries while staying aligned with business objectives.\nDevelop and implement scalable processes.\nIdentify opportunities to improve the customer experience, increase retention, and generate additional post-sales revenue streams\nWork with departments such as Logistics and Product to ensure seamless coordination and alignment on customer-related initiatives.\n\nRequirements\n\nYou possess a Bachelor's degree or Master's degree in Business or a related field\nYou are curious and passionate about hyper growth startups \nYou want to change a traditional industry together with an international team\nYou have strong analytical and communication skills - you have ability to clearly articulate complex subject materials\nYou possess Hands-on mentality - only the implementation satisfies you\nYou bring first experience in a highly competitive and fast paced environment such as Management Consulting, Investment Banking, Venture Capital or a high-growth startup\nYou have excellent communication skills in German and English\n\nBenefits\n\nA role to fulfill with entrepreneurial freedom and a pre-validated business model to be pushed to the next level\nAn experienced founding team (three companies, 2 exits)\nA future-proof job with an attractive salary in a successful and value-oriented company\nCollaboration with top-tier investors and angles (incl. various unicorn founders) as well as leading market experts\nA challenging yet rewarding work environment, and the opportunity to make a significant impact within a rapidly growing company\nBeautiful office space in the center of Berlin, monthly all-hands, team events, and team lunches\n\nJoin one of the fastest-growing B2B companies in Europe in an industry that is starving for innovative solutions. Work with an international intercultural team led by serial entrepreneurs and seasoned executives, advised by some of the brightest minds in the industry.\nWe are looking forward to hearing from you!\nInternal job reference: f9f4672d-b37c-4025-a78a-d865a623707b\nFind Jobs in Germany on Arbeitnow"
    },
    {
        "title": "Software Quality Assurance and Certification Engineer (w/m/d) - 100%",
        "location": "Munich",
        "url": "https://www.arbeitnow.com/jobs/companies/concape/software-quality-assurance-and-certification-engineer-100-munich-233374",
        "desc": "CONCAPE is a specialized recruiter and supports an international, specialized company in the field of high technology and mechanical engineering with this vacancy.\nWork location: Lake Constance region, Germany\nWorkload: 100%\nHome office: 2 days\nThe company has enabled its development into a renowned company in areas such as construction machinery, transportation technology and engineering thanks to product innovation & employees (m/f).\nAufgaben\nSoftware Quality Assurance and Certification Engineer (w/m/d) - 100%\nYour challenges\n\nEnsure quality and delivery capability: As a Supplier Quality Engineer, you ensure that suppliers' products and services meet the company's quality standards and delivery deadlines.\nDefine and communicate quality requirements: As a Supplier Quality Engineer, you define the quality requirements for products and services and communicate these to suppliers.\nCoordinate and monitor approval procedures: As a Supplier Quality Manager, you will coordinate and monitor supplier approval procedures to ensure they meet the company's requirements.\nParticipate in projects: As a Supplier Quality Engineer, you will often work on projects to improve collaboration with suppliers and ensure the quality of products and services.\nOptimize work processes: As a Supplier Quality Manager, you can help optimize workflows to reduce costs and improve efficiency.\nPerform failure analysis: As a Supplier Quality Engineer, you will perform failure analyses to determine the root causes of failures and resolve them.\n\nQualifikation\nYour qualifications\n\nDegree in industrial engineering, mechanical engineering, aerospace engineering or a related field\nExperience with audits and an additional qualification as an auditor are an advantage\nComprehensive knowledge of the Advanced Product Quality Planning (APQP) process, including its components\nFluency in German and English\nAnalytical thinking and a solution-oriented way of working\nWillingness to travel extensively\nSelf-motivation and the ability to assert yourself\n\nBenefits\nWhat happens next:\nDo you have any questions in advance?\nWe look forward to getting in touch with you.\nYour\nCONCAPE team\nFind Jobs in Germany on Arbeitnow"
    },
    {
        "title": "Software Quality Assurance and Certification Engineer (w/m/d) - 100%",
        "location": "Munich",
        "url": "https://www.arbeitnow.com/jobs/companies/concape/software-quality-assurance-and-certification-engineer-100-munich-154147",
        "desc": "CONCAPE is a specialized recruiter and supports an international, specialized company in the field of high technology and mechanical engineering with this vacancy.\nWork location: Lake Constance region, Germany\nWorkload: 100%\nHome office: 2 days\nThe company has enabled its development into a renowned company in areas such as construction machinery, transportation technology and engineering thanks to product innovation & employees (m/f).\nAufgaben\nSoftware Quality Assurance and Certification Engineer (w/m/d) - 100%\nYour challenges\n\nEnsure quality and delivery capability: As a Supplier Quality Engineer, you ensure that suppliers' products and services meet the company's quality standards and delivery deadlines.\nDefine and communicate quality requirements: As a Supplier Quality Engineer, you define the quality requirements for products and services and communicate these to suppliers.\nCoordinate and monitor approval procedures: As a Supplier Quality Manager, you will coordinate and monitor supplier approval procedures to ensure they meet the company's requirements.\nParticipate in projects: As a Supplier Quality Engineer, you will often work on projects to improve collaboration with suppliers and ensure the quality of products and services.\nOptimize work processes: As a Supplier Quality Manager, you can help optimize workflows to reduce costs and improve efficiency.\nPerform failure analysis: As a Supplier Quality Engineer, you will perform failure analyses to determine the root causes of failures and resolve them.\n\nQualifikation\nYour qualifications\n\nDegree in industrial engineering, mechanical engineering, aerospace engineering or a related field\nExperience with audits and an additional qualification as an auditor are an advantage\nComprehensive knowledge of the Advanced Product Quality Planning (APQP) process, including its components\nFluency in German and English\nAnalytical thinking and a solution-oriented way of working\nWillingness to travel extensively\nSelf-motivation and the ability to assert yourself\n\nBenefits\nWhat happens next:\nDo you have any questions in advance?\nWe look forward to getting in touch with you.\nYour\nCONCAPE team\nFind Jobs in Germany on Arbeitnow"
    },
    {
        "title": "Performance Marketing Manager (m/f/d) - Remote",
        "location": "Berlin",
        "url": "https://www.arbeitnow.com/jobs/companies/xentral-erp-software-gmbh/performance-marketing-manager-remote-berlin-463900",
        "desc": "Performance Marketing is a crucial part of our go-to-market strategy at Xentral ERP Software. We are looking for an experienced performance marketing expert, who helps us to generate MQL optimised for cost per SQL.   \nYou will be responsible for our performance marketing strategy in alignment with our overarching business plan and all our paid channels - currently Google Ads, Microsoft Ads, LinkedIn Ads and META Ads. In alignment with the demand generation team (Paid, SEO, Content & CVRO) you are a driving force for demand generation and lead capture tactics.\nYour Tasks:\n\nManage the entire lifecycle of performance marketing campaigns with a strong focus on Google Ads Hands-on implement and extend demand generation strategies within Google Ads, LinkedIn Ads, META Ads\nHelp to identify and set up new paid marketing channels (e.g. review pages such as Capterra & OMR Reviews, Content Syndication, …)\nDefine – and with the help of our designer and CVRO specialist – support A/B testing of landing page, ad copy, creatives\nCrunch data on a daily basis to monitor and improve the performance of all channels based on cost per SQL (use Hubspot oriented channel reporting)\nManage budget and media planning while analysing and presenting performance insights confidently\nSupport landing page creation and optimization, contributing to demand generation through LinkedIn, YouTube, and Google Demand Gen\nDevelop and implement re-targeting tactics across multiple channels, focusing on high-performing video and image creatives.\n\nYour Profile:\n\nYou have 2 years hands-on experience in growing performance marketing, ideally for a B2B SaaS company\nYou have strong hands-on expertise in managing Google Ads\nIdeally you have first experience working with paid social channels\nYou are used to work in a dynamic environment – experience in a scale-up would be a big plus\nYou are analytically driven and understand technical aspects of performance marketing like e.g. conversion tracking, attribution, etc\nYou have a hands-on mentality\nOur target audience is focused mainly in german-speaking countries, so you are fluent or near-native in German, as you have to write ads or support with landing page content\n\nWe offer \nFlexible Work Environment: Enjoy remote work options across Europe or from our office-hubs in Augsburg, Amsterdam, Berlin, Munich, and Lohne (Oldenburg), along with flexible working hours.  \nCompetitive Compensation & Comprehensive Benefits: Attractive salary packages and a generous leave policy that includes 28 annual leave days, special leave days, and nursing care days. Our comprehensive benefits package also provides a monthly voucher to choose from a variety of providers, including Urban Sports Club, grocery stores, entertainment, and lifestyle options. Additionally, we equip all employees with state-of-the-art home office equipment and offer a 50% subsidy on private pension plans for permanent employees in Germany.  \nProfessional Growth & Development: Benefit from a significant budget dedicated to learning and personal development, supporting your career growth and continuous learning.  \nInclusive & Engaging Culture: Participate in virtual and in-person company events and in our yearly culture connect days, fostering a collaborative and vibrant company culture with minimal hierarchies and respectful communication.  \nDiverse & International Team: Work alongside a multicultural and international team across 17 different work locations within Europe and 32 nationalities, embracing diversity and a global perspective.  \nYou have what it takes? Then apply now with your CV or LinkedIn profile. \nWe look forward to your application! \nAbout us \nWe are an established tech startup with major tech investors Sequoia Capital and Visionaries Club on our side. We are aiming at defining a new SaaS category and empower entrepreneurs and e-commerce vendors to automate their resource planning and focus on the things that matters most to them: their business.\nWe grow all over Europe, join us fully remote or in one of our hubs in Augsburg, Amsterdam, Berlin, Munich and Lohne (Oldenburg). You decide!\nFind more English Speaking Jobs in Germany on Arbeitnow"
    },
    {
        "title": "Site Reliability Engineer",
        "location": "Berlin",
        "url": "https://www.arbeitnow.com/jobs/companies/nooxit/site-reliability-engineer-berlin-106931",
        "desc": "Full-time (40 h), as soon as possible, permanent and based in Berlin or remotely in home office. \nWe’re seeking an experienced Site Reliability Engineer (SRE) with a solid foundation in Python, a passion for performance optimization, and a proactive approach to infrastructure management. In this role, you’ll work closely with development and operations teams to maintain, monitor, and improve the reliability of our systems, leveraging cutting-edge tools and methodologies to ensure peak performance.\nTasks\n\nDesign, implement, and optimize systems to improve the reliability, performance, and scalability of our services.\nBuild and maintain observability solutions using tools like Jaeger, Prometheus, and Grafana to enhance monitoring, tracing, and alerting across applications.\nCollaborate with development teams to build, manage, and scale Kubernetes environments, ensuring high availability and robust service delivery.\nDevelop automation scripts and tools in Python to enhance system reliability and reduce manual intervention.\nDiagnose and resolve incidents, conduct root-cause analysis, and implement measures to prevent recurrence.\nParticipate in on-call rotations, ensuring rapid response to system issues while continuously improving incident management processes.\n\nRequirements\n\nProficiency in Python for scripting and automation.\nExperience with tracing tools such as Jaeger or similar to troubleshoot and monitor complex distributed systems.\nExperience with monitoring tools such as Prometheus or similar for collecting and alerting on metrics.\nExperience with dashboarding tools such as Grafana or similar for creating visualizations that aid in system monitoring and diagnostics.\nExperience working in Kubernetes environments, with an understanding of container orchestration, scaling, and resource management.\n\nPreferred Qualifications (Optional):\n\nHands-on experience with CI/CD pipelines and DevOps practices.\nFamiliarity with cloud platforms (AWS, GCP, Azure) and infrastructure-as-code tools like OpenTofu.\n\nBenefits\n\nCompetitive salary\nFlexible work hours and remote work opportunities.\nA beautiful Gather remote office\nAn ambitious and helpful team\nOpportunity to work with cutting-edge technologies and make a significant impact in a fast-growing startup environment\n\nAre you interested?\nThen apply right now by sending your CV If available, please include a Github link. A cover letter is not necessary.\nIf you have any questions, please contact us or just give us a call!\nFind more English Speaking Jobs in Germany on Arbeitnow"
    }
]